Обработки/Reports/_ОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОстаткиДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтбора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНепройденныеСверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоСДвижениями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОстатка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВывестиОстаткиЗаВычетомЗаблокированныхНаМНО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОстаткиДенежныхСредств/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область События_формы_и_элементов

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Если Параметры.Свойство("Организация") Тогда
		Отчет.Организация = Параметры.Организация;
	КонецЕсли;
	
	Отчет.Период.ДатаОкончания	= НачалоДня(ТекущаяДата()) - 1;
	Отчет.Период.ДатаНачала		= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, Отчет.Период.ДатаОкончания);
	
	Если Параметры.Свойство("ДатаСверки") Тогда
		Отчет.Период.ДатаНачала		= Параметры.ДатаСверки;
		Отчет.Период.ДатаОкончания	= Параметры.ДатаСверки	
	КонецЕсли;

	Если НачалоДня(Отчет.Период.ДатаНачала) <> НачалоДня(Отчет.Период.ДатаОкончания) Тогда
		ЭтаФорма.ВидПериода = "Период";
	КонецЕсли;
	
	Если Параметры.Свойство("РежимОтбора") И Параметры.Свойство("СчетДоверительногоУправления") Тогда
		Отчет.РежимОтбора					= Параметры.РежимОтбора;
		Отчет.СчетДоверительногоУправления	= Параметры.СчетДоверительногоУправления;
		
		ЭтаФорма.ОтборИзПараметров = Истина;
	КонецЕсли;
	
	// Добавим возможность менять организацию для полных прав 
	Элементы.ОрганизацияПараметр.Видимость	= РаботаСПользователями.ЭтоПолноправныйПользователь();
	Элементы.Организация.Видимость			= Не Элементы.ОрганизацияПараметр.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)

	Если Параметры.Свойство("РежимОтбора") Тогда
		Настройки.Вставить("Отчет.РежимОтбора", Параметры.РежимОтбора);
	КонецЕсли;
	
	Если Параметры.Свойство("СчетДоверительногоУправления") Тогда
		Настройки.Вставить("Отчет.СчетДоверительногоУправления", Параметры.СчетДоверительногоУправления);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)

	РаботаСОтчетами.ЗапомнитьКлючВариантаОтчета(Отчет, ЭтаФорма.КлючТекущегоВарианта);
	
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(ЭтаФорма.Отчет);		
	
	Если ВариантОтчета = "ПросмотрОстатков" Тогда
		
		Если Отчет.Период.ДатаНачала <> НачалоДня(Отчет.Период.ДатаОкончания) Тогда
			ЭтаФорма.ВидПериода = "Период";		
		КонецЕсли;
		
	Иначе
		
		// Сверка разрешена только за 1 рабочий день по всем остаткам
		
		Отчет.ТипОстатка = "";
		ЭтаФорма.ВидПериода = "";
		УстановитьПериодСверки(Отчет.Период);
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЭтаФорма.ОтборИзПараметров Тогда
		ЭтаФорма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПриИзмененииПериода();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(Отчет);	
	
	Если ВариантОтчета = "ПросмотрОстатков" Тогда
		
		Если ЭтаФорма.ВидПериода = "" Тогда // День
			Отчет.Период.ДатаОкончания = КонецДня(Отчет.Период.ДатаНачала);
		КонецЕсли;		
		
	Иначе
		
		УстановитьПериодСверки(Отчет.Период);
		
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПериода();

КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПериодаПриИзменении(Элемент)
	
	ПериодДатаНачалаПриИзменении(Элемент);	
	
	НастроитьВидимостьИДоступность(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтбораПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(ЭтаФорма);

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДеятельностиПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоговораДоверительногоУправленияПриИзменении(Элемент)
	
	ПриИзмененииПараметровОтчета(ЭтаФорма);	

КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчетПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОстаткаПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСДвижениямиПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоНепройденныеСверкиПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПараметрПриИзменении(Элемент)

	ПриИзмененииПараметровОтчета(ЭтаФорма);	
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)

	Если ТипЗнч(Результат.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
		ПодключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура КомандаВвестиПериод(Команда)

	ДиалогВыбораПериода = Новый ДиалогРедактированияСтандартногоПериода();
	ДиалогВыбораПериода.Период.ДатаНачала		= Отчет.Период.ДатаНачала;
	ДиалогВыбораПериода.Период.ДатаОкончания	= Отчет.Период.ДатаОкончания;
	
	Если ДиалогВыбораПериода.Редактировать() Тогда 
		Отчет.Период.ДатаНачала		= ДиалогВыбораПериода.Период.ДатаНачала;
		Отчет.Период.ДатаОкончания	= ДиалогВыбораПериода.Период.ДатаОкончания;
		
		ПриИзмененииПараметровОтчета(ЭтаФорма);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		СформироватьОтчет();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьРезультатыСверки(Команда)

	СохранитьРезультатыСверки();
	
КонецПроцедуры

#КонецОбласти

#Область Вспомогательные_функции

&НаСервере
Процедура СформироватьОтчет()

	ДанныеРасшифровкиЗначение = Неопределено;	
	ЭтаФорма.Результат.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СкомпоноватьРезультат(ЭтаФорма.Результат, ДанныеРасшифровкиЗначение);
	
	ДанныеРасшифровки = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиЗначение, ЭтаФорма.УникальныйИдентификатор);	
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат);				
	
	Если ОтчетОбъект.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Свойство("ВыведенныеСчетаДоверительногоУправления") Тогда
		ВыведенныеСчетаДоверительногоУправления.ЗагрузитьЗначения(ОтчетОбъект.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.ВыведенныеСчетаДоверительногоУправления);
		Элементы.ФормаКомандаСохранитьРезультатыСверки.Доступность = Истина;
	Иначе
		Элементы.ФормаКомандаСохранитьРезультатыСверки.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьРезультатыСверки()
	
	ПараметрыОтчета = Новый Структура("Организация, ПериодСверки, СчетаДоверительногоУправления", Отчет.Организация, Отчет.Период, ВыведенныеСчетаДоверительногоУправления);
	
	ЗаполнитьЗначенияСвойств(ПараметрыОтчета, ЭтаФорма.Отчет);
	
	ПараметрыФормы = Новый Структура("ПараметрыОтчета", ПараметрыОтчета);
	
	ОткрытьФормуМодально(Лев(ЭтаФорма.ИмяФормы, СтрНайти(ЭтаФорма.ИмяФормы, ".", НаправлениеПоиска.СКонца)) + "ФормаСохраненияРезультатовСверки", ПараметрыФормы, ЭтаФорма); 
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПериодСверки(Период)
	
	Период.ДатаНачала		= Справочники.Календари.ПолучитьБлижайшуюРабочуюДату(Справочники.Календари.Общероссийский, Период.ДатаНачала);
	Период.ДатаОкончания	= Справочники.Календари.ДобавитьКДатеРабочиеДни(Справочники.Календари.Общероссийский, КонецДня(Период.ДатаНачала) + 1, 1) - 1; 

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(ЭтаФорма)

	Отчет		= ЭтаФорма.Отчет;
	Элементы	= ЭтаФорма.Элементы;
	
	ВариантОтчета = РаботаСОтчетамиКлиентСервер.ПолучитьИмяПредопределенногоВариантаОтчета(Отчет);	
	
	ПериодДень = (ЭтаФорма.ВидПериода = "");
	
	Элементы.Период.Видимость						= ПериодДень;
	Элементы.ГруппаПериодИнтервал.Видимость			= Не ПериодДень; 

	Элементы.СчетДоверительногоУправления.Видимость			= (Отчет.РежимОтбора = 1);
	Элементы.ВидДеятельности.Видимость						= (Отчет.РежимОтбора = 2);
	Элементы.БанковскийСчет.Видимость						= (Отчет.РежимОтбора = 3);
	Элементы.ВидДоговораДоверительногоУправления.Видимость 	= (Отчет.РежимОтбора = 4);
	
	Элементы.ВывестиОстаткиЗаВычетомЗаблокированныхНаМНО.Видимость = ВариантОтчета = "ОстаткиСМНО";

	Элементы.ГруппаКомандыСверки.Видимость				= Не (ВариантОтчета = "ПросмотрОстатков" Или ВариантОтчета = "ОстаткиСМНО");
	Элементы.ВидПериода.Доступность						= (ВариантОтчета = "ПросмотрОстатков" Или ВариантОтчета = "ОстаткиСМНО");
	Элементы.ТипОстатка.Видимость						= (ВариантОтчета = "ПросмотрОстатков");
	Элементы.ГруппаДополнительныеНастройки.Видимость	= ВариантОтчета <> "ОстаткиСМНО";
	
	Если Отчет.Период.ДатаНачала = НачалоДня(Отчет.Период.ДатаОкончания) Тогда
		Элементы.Период.Подсказка = "";	
	Иначе
		Элементы.Период.Подсказка = "Период сверки с учетом нерабочих дней: " + Отчет.Период;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПриИзмененииПараметровОтчета(ЭтаФорма)
	
	ЭтаФорма.Элементы.ФормаКомандаСохранитьРезультатыСверки.Доступность = Ложь;
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат, "НеАктуальность");		
	
КонецПроцедуры

#Область Расчет_суммы_выделенных_ячеек

&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеСумма, Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	Сумма = 0;
	Для Каждого КлючИЗначение Из КэшВыделеннойОбласти Цикл
		СтруктураАдресВыделеннойОбласти = КлючИЗначение.Значение;
		Для ИндексСтрока = СтруктураАдресВыделеннойОбласти.Верх По СтруктураАдресВыделеннойОбласти.Низ Цикл
			Для ИндексКолонка = СтруктураАдресВыделеннойОбласти.Лево По СтруктураАдресВыделеннойОбласти.Право Цикл
				Попытка
					Ячейка = Результат.Область(ИндексСтрока, ИндексКолонка, ИндексСтрока, ИндексКолонка);
					Если Ячейка.Видимость = Истина Тогда
						Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
							Сумма = Сумма + Ячейка.Значение;
						ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
							Сумма = Сумма + Число(СтрЗаменить(Ячейка.Текст, " ", ""));
						КонецЕсли;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КэшВыделеннойОбласти.Вставить("Сумма", Сумма);
	
	ПолеСумма = Сумма;
	
КонецПроцедуры

&НаКлиенте
Функция НеобходимоОбновитьСумму(Результат, КэшВыделеннойОбласти)
	Перем СтруктураАдресВыделеннойОбласти;
	
	ВыделенныеОбласти    = Результат.ВыделенныеОбласти;
	КоличествоВыделенных = ВыделенныеОбласти.Количество();
	
	Если КоличествоВыделенных = 0 Тогда
		КэшВыделеннойОбласти = Новый Структура();
		Возврат Истина;
	КонецЕсли;
	
	ВозвращаемоеЗначение = Ложь;
	Если ТипЗнч(КэшВыделеннойОбласти) <> Тип("Структура") Тогда
		КэшВыделеннойОбласти = Новый Структура();
		ВозвращаемоеЗначение = Истина;
	ИначеЕсли ВыделенныеОбласти.Количество() <> КэшВыделеннойОбласти.Количество() Тогда
		КэшВыделеннойОбласти = Новый Структура();
		ВозвращаемоеЗначение = Истина;
	Иначе
		Для ИндексОбласти = 0 По КоличествоВыделенных - 1 Цикл
			ВыделеннаяОбласть = ВыделенныеОбласти[ИндексОбласти];
			ИмяОбласти = СтрЗаменить(ВыделеннаяОбласть.Имя, ":", "_");
			КэшВыделеннойОбласти.Свойство(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
			
			// не нашли нужную область в кэше, поэтому переинициализируем кэш
			Если ТипЗнч(СтруктураАдресВыделеннойОбласти) <> Тип("Структура") Тогда
				КэшВыделеннойОбласти = Новый Структура();
				ВозвращаемоеЗначение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Для ИндексОбласти = 0 По КоличествоВыделенных - 1 Цикл
		ВыделеннаяОбласть = ВыделенныеОбласти[ИндексОбласти];
		ИмяОбласти = СтрЗаменить(ВыделеннаяОбласть.Имя, ":", "_");
		
		Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			СтруктураАдресВыделеннойОбласти = Новый Структура("Верх, Низ, Лево, Право", 0, 0, 0, 0);
			КэшВыделеннойОбласти.Вставить(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
			ВозвращаемоеЗначение = Истина;
			Продолжить;
		КонецЕсли;
		
		КэшВыделеннойОбласти.Свойство(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
		Если ТипЗнч(СтруктураАдресВыделеннойОбласти) <> Тип("Структура") Тогда
			СтруктураАдресВыделеннойОбласти = Новый Структура("Верх, Низ, Лево, Право", 0, 0, 0, 0);
			КэшВыделеннойОбласти.Вставить(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
			ВозвращаемоеЗначение = Истина;
		КонецЕсли;
		
		Если СтруктураАдресВыделеннойОбласти.Верх <> ВыделеннаяОбласть.Верх
			ИЛИ СтруктураАдресВыделеннойОбласти.Низ <> ВыделеннаяОбласть.Низ
			ИЛИ СтруктураАдресВыделеннойОбласти.Лево <> ВыделеннаяОбласть.Лево
			ИЛИ СтруктураАдресВыделеннойОбласти.Право <> ВыделеннаяОбласть.Право Тогда
				СтруктураАдресВыделеннойОбласти = Новый Структура("Верх, Низ, Лево, Право",
					ВыделеннаяОбласть.Верх, ВыделеннаяОбласть.Низ, ВыделеннаяОбласть.Лево, ВыделеннаяОбласть.Право);
				КэшВыделеннойОбласти.Вставить(ИмяОбласти, СтруктураАдресВыделеннойОбласти);
				ВозвращаемоеЗначение = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ВозвращаемоеЗначение;
	
КонецФункции

&НаКлиенте
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеСумма, Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере) Экспорт
	
	Если НеобходимоОбновитьСумму(Результат, КэшВыделеннойОбласти) Тогда
		ПолеСумма = 0;
		КоличествоВыделенныхОбластей = КэшВыделеннойОбласти.Количество();
		Если КоличествоВыделенныхОбластей = 0      // Ничего не выделено
			ИЛИ КэшВыделеннойОбласти.Свойство("T") // Выделен весь табличный документ (Ctrl+A)
			Тогда
			КэшВыделеннойОбласти.Вставить("Сумма", 0);
		ИначеЕсли КоличествоВыделенныхОбластей = 1 Тогда
			// Если выделено небольшое количество ячейек, то получим сумму на клиенте
			Для каждого КлючИЗначение Из КэшВыделеннойОбласти Цикл
				СтруктураАдресВыделеннойОбласти = КлючИЗначение.Значение;
			КонецЦикла;
			
			РазмерОбластиПоВертикали   = СтруктураАдресВыделеннойОбласти.Низ   - СтруктураАдресВыделеннойОбласти.Верх;
			РазмерОбластиПоГоризонтали = СтруктураАдресВыделеннойОбласти.Право - СтруктураАдресВыделеннойОбласти.Лево;
			
			// В некоторых отчетах показатели (да и аналитика на котрую может встать пользователь
			// выводятся в "объединенных" ячейках - не желательно в этом случае делать сервереный вызов. 
			// Выделенная область из 10 ячеек закрывает все такие случае и скорее всего всегда будет доступна на клиенте.
			// Максимум, может быть сделан один неявный серверный вызов
			ВычислитьНаКлиенте = (РазмерОбластиПоВертикали + РазмерОбластиПоГоризонтали) < 12;
			Если ВычислитьНаКлиенте Тогда
				СуммаВЯчейках = 0;
				Для ИндексСтрока = СтруктураАдресВыделеннойОбласти.Верх По СтруктураАдресВыделеннойОбласти.Низ Цикл
					Для ИндексКолонка = СтруктураАдресВыделеннойОбласти.Лево По СтруктураАдресВыделеннойОбласти.Право Цикл
						Попытка
							Ячейка = Результат.Область(ИндексСтрока, ИндексКолонка, ИндексСтрока, ИндексКолонка);
							Если Ячейка.Видимость = Истина Тогда
								Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
									СуммаВЯчейках = СуммаВЯчейках + Ячейка.Значение;
								ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
									ЧислоВЯчейке  = Вычислить("Число(СтрЗаменить(Ячейка.Текст, Символ(32), Символ(0)))");
									СуммаВЯчейках = СуммаВЯчейках + ЧислоВЯчейке;
								КонецЕсли;
							КонецЕсли;
						Исключение
						КонецПопытки;
					КонецЦикла;
				КонецЦикла;
				
				ПолеСумма = СуммаВЯчейках;
				КэшВыделеннойОбласти.Вставить("Сумма", ПолеСумма);
			Иначе
				// Если ячеек много, то лучше вычислим сумму ячеек на сервере за один вызов,
				// т.к. неявных серверных вызовов может быть гораздо больше
				НеобходимоВычислятьНаСервере = Истина;
			КонецЕсли;
		Иначе
			// Вычислим сумму ячеек на сервере
			НеобходимоВычислятьНаСервере = Истина;
		КонецЕсли;
	Иначе	
		ПолеСумма = КэшВыделеннойОбласти.Сумма;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекстСообщения = "";
	
	Если ВидПериода = "Период" И Не ОбщегоНазначенияКлиентСервер.ПериодЗаполненКорректно(Отчет.Период,,, ТекстСообщения) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,, "Отчет.Период.Дата" + ?(Лев(ТекстСообщения,9) = "Окончание", "Окончания", "Начала"), Отказ);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
